Revit 2027 API
BuiltInFailures.TextFailures Class
 Failures about Text.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.TextFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class TextFailures
Public NotInheritable Class TextFailures
public ref class TextFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TextFailures = class end
The BuiltInFailures.TextFailures type exposes the following members.
Properties
Name | Description
CannotCreateModeltext |  Can't create Model Text.
ModeltextIsEmpty |  Model Text deleted because it consists entirely of spaces and/or carriage returns.
Top
See Also
Reference
Autodesk.Revit.DB Namespace